[
  {
    "Id": "The C Programming Language",
    "Maker": "@jenlooper",
    "img": "https://hdphotos.blob.core.windows.net/cover/TheC\u002B\u002BProgrammingLanguage.png",
    "Url": "https://kremlin.cc/k&r.pdf",
    "Author": "Brian W. Kernighan",
    "Publisher": "Pearson",
    "Publication": "March, 1988",
    "ISBN": "978-0131103627",
    "Author_Description": "Brian Wilson Kernighan is a Canadian computer scientist. He worked at Bell Labs and contributed to the development of Unix alongside Unix creators Ken Thompson and Dennis Ritchie. Kernighan\u0027s name became widely known through co-authorship of the first book on the C programming language with Dennis Ritchie.",
    "Title": "The C Programming Language",
    "Description": "This book is meant to help the reader learn how to program in C. It is the definitive reference guide, now in a second edition. Although the first edition was written in 1978, it continues to be a worldwide best-seller. This second edition brings the classic original up to date to include the ANSI standard.",
    "Ratings": [
      5,
      5,
      5,
      5,
      1,
      5,
      5,
      5,
      5,
      5,
      4,
      5,
      5
    ],
    "Comments": [
      "test",
      "does this work"
    ]
  },
  {
    "Id": "Artificial Intelligence: A Modern Approach",
    "Maker": "jenlooper",
    "img": "https://hdphotos.blob.core.windows.net/cover/ArtificialIntelligenceAModernApproach.jpg",
    "Url": "https://cs.calvin.edu/courses/cs/344/kvlinden/resources/AIMA-3rd-edition.pdf",
    "Author": "Stuart Russell",
    "Publisher": "Prentice Hall PTR",
    "Publication": "December, 2002",
    "ISBN": "978-0-13-604259-4",
    "Author_Description": "Stuart Jonathan Russell OBE is a British computer scientist known for his contributions to Artificial Intelligence. He is a Professor of Computer Science at the University of California, Berkeley and Adjunct Professor of Neurological Surgery at the University of California, San Francisco ",
    "Title": "Artificial Intelligence: A Modern Approach",
    "Description": "For one or two-semester, undergraduate or graduate-level courses in Artificial Intelligence. The long-anticipated revision of this best-selling text offers the most comprehensive, up-to-date introduction to the theory and practice of artificial intelligence.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Refactoring: Improving the Design of Existing Code",
    "Maker": "sailorhg",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/RefactoringImprovingtheDesignofExistingCode.jpg",
    "Url": "http://silab.fon.bg.ac.rs/wp-content/uploads/2016/10/Refactoring-Improving-the-Design-of-Existing-Code-Addison-Wesley-Professional-1999.pdf",
    "Author": "Martin Fowler, Kent Beck",
    "Publisher": "Addison-Wesley Professional",
    "Publication": "July, 1997",
    "ISBN": "978-0201896831",
    "Author_Description": "Martin Fowler : Martin Fowler is an American-resident British software developer, author and international public speaker on software development, specialising in object-oriented analysis and design.\r\nKent Beck : Kent Beck is an American software engineer and the creator of extreme programming, a software development methodology that eschews rigid formal specification for a collaborative and iterative design process.",
    "Title": "Refactoring: Improving the Design of Existing Code",
    "Description": "As the application of object technology?particularly the Java programming language?has become commonplace, a new problem has emerged to confront the software development community. Significant numbers of poorly designed programs have been created by less-experienced developers, resulting in applications that are inefficient and hard to maintain and extend. Increasingly, software system professionals are discovering just how difficult it is to work with these inherited, non-optimal applications. For several years, expert-level object programmers have employed a growing collection of techniques to improve the structural integrity and performance of such existing software programs. ",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "The Art of Computer Programming, Volume 1: Fundamental Algorithms",
    "Maker": "sailorhg",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/TheArtofComputerProgrammingVolume1FundamentalAlgorithms.jpg",
    "Url": "https://doc.lagout.org/science/0_Computer%20Science/2_Algorithms/The%20Art%20of%20Computer%20Programming%20(vol.%201_%20Fundamental%20Algorithms)%20(3rd%20ed.)%20%5BKnuth%201997-07-17%5D.pdf",
    "Author": "Donald Ervin Knuth",
    "Publisher": "Addison-Wesley Professional",
    "Publication": "December, 1999",
    "ISBN": "9780201896831",
    "Author_Description": "Donald Ervin Knuth is an American computer scientist, mathematician, and professor emeritus at Stanford University. He is the 1974 recipient of the ACM Turing Award, informally considered the Nobel Prize of computer science. ",
    "Title": "The Art of Computer Programming, Volume 1: Fundamental Algorithms",
    "Description": "This first volume in the series begins with basic programming concepts and techniques, then focuses more particularly on information structures-the representation of information inside a computer, the structural relationships between data elements and how to deal with them efficiently. Elementary applications are given to simulation, numerical methods, symbolic computing, software and system design. Dozens of simple and important algorithms and techniques have been added to those of the previous edition. The section on mathematical preliminaries has been extensively revised to match present trends in research.",
    "Ratings": [
      5
    ],
    "Comments": null
  },
  {
    "Id": "Algorithms",
    "Maker": "sailorhg",
    "img": "https://images-na.ssl-images-amazon.com/images/I/41-RWwEls6L.jpg",
    "Url": "http://index-of.es/Varios-2/Algorithms%204th%20Edition.pdf",
    "Author": "Robert Sedgewick, Kevin Wayne",
    "Publisher": "Addison-Wesley Professional",
    "Publication": "April, 2011",
    "ISBN": "032157351X",
    "Author_Description": "Robert Sedgewick: he is the founding chair and the William O. Baker Professor in Computer Science at Princeton University and was a member of the board of directors of Adobe Systems. Dr. Kevin Wayne : he is an award-winning scholar and has served as a professor of business administration at Rivier University for the past fourteen years. ",
    "Title": "Algorithms",
    "Description": "This fourth edition of Robert Sedgewick and Kevin Wayne\u0027s Algorithms is the leading textbook on algorithms today and is widely used in colleges and universities worldwide. This book surveys the most important computer algorithms currently in use and provides a full treatment of data structures and algorithms for sorting, searching, graph processing, and string processing -- including fifty algorithms every programmer should know. In this edition, new Java implementations are written in an accessible modular programming style, where all of the code is exposed to the reader and ready to use.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Modern Operating Systems",
    "Maker": "sailorhg",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/ModernOperatingSystems.jpg",
    "Url": "https://csc-knu.github.io/sys-prog/books/Andrew%20S.%20Tanenbaum%20-%20Modern%20Operating%20Systems.pdf",
    "Author": "Andrew S. Tanenbaum, Herbert Bos",
    "Publisher": "Prentice Hall; Subsequent edition",
    "Publication": "February, 2001",
    "ISBN": "0130313580",
    "Author_Description": "Andrew S. Tanenbaum: Andrew Stuart Tanenbaum, sometimes referred to by the handle ast, is an American-Dutch Physicist and Professor emeritus of Computer Science at the Vrije Universiteit Amsterdam in Netherlands. Herbert Bos: Herbert Bos is full professor at the Vrije Universiteit Amsterdam and co-leads the VUSec Systems Security research group with Cristiano Giuffrida, Erik van der Kouwe, Bala Chandrasekaran and Klaus von Gleissenthall.",
    "Title": "Modern Operating Systems",
    "Description": "For software development professionals and computer science students, Modern Operating Systems gives a solid conceptual overview of operating system design, including detailed case studies of Unix/Linux and Windows 2000.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Working Effectively with Legacy Code",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/WorkingEffectivelywithLegacyCode.jpg",
    "Url": "http://standars.optimeconsulting.net/wp-content/uploads/2016/04/WorkingEffectivelyWithLegacyCode.pdf",
    "Author": "Michael C. Feathers",
    "Publisher": "Prentice Hall; US Ed edition ",
    "Publication": "August, 2002",
    "ISBN": "978-0131177055",
    "Author_Description": "MICHAEL C. FEATHERS works for Object Mentor, Inc., one of the world's top providers of mentoring, skill development, knowledge transfer, and leadership services in software development. He currently provides worldwide training and mentoring in Test-Driven Development (TDD), Refactoring, OO Design, Java, C#, C++, and Extreme Programming (XP).",
    "Title": "Working Effectively with Legacy Code",
    "Description": "In this book, Michael Feathers offers start-to-finish strategies for working more effectively with large, untested legacy code bases. This book draws on material Michael created for his renowned Object Mentor seminars, techniques Michael has used in mentoring to help hundreds of developers, technical managers, and testers bring their legacy systems under control.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Computer Systems: A Programmers Perspective",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/ComputerSystemsAProgrammerPerspective.jpg",
    "Url": "https://pdf.zlibcdn.com/dtoken/732da4df03cbbc8f6a608633a2cb94a0/Computer_Systems_A_Programmers_Perspective_by_Ra_2611328_(z-lib.org).pdf",
    "Author": "Randal E. Bryant, David R. Hallaron",
    "Publisher": "Pearson",
    "Publication": "September, 2004",
    "ISBN": "013034074X",
    "Author_Description": "Randal E. Bryant is an American computer scientist and academic noted for his research on formally verifying digital hardware and software.",
    "Title": "Computer Systems: A Programmers Perspective",
    "Description": "For Computer Organization and Architecture and Computer Architecture courses. Often, computer science and computer engineering curricula don\u0027t provide students with a concentrated and consistent introduction to the fundamental concepts that underlie all computer systems. Traditional computer organization and logic design courses cover some of this material, but they focus largely on hardware design. They provide students with little or no understanding of how important software components operate, how application programs use systems, or how system attributes affect the performance and correctness of application programs.  ",
    "Ratings": [
      5
    ],
    "Comments": null
  },
  {
    "Id": "Computer Networks",
    "Maker": "vogueandcode",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/ComputerNetworks.jpg",
    "Url": "http://index-of.es/Varios-2/Computer%20Networks%205th%20Edition.pdf",
    "Author": "Andrew C. Tanenbaum",
    "Publisher": "Computer Networks",
    "Publication": "September, 2010",
    "ISBN": "0132126958",
    "Author_Description": "Andrew Stuart Tanenbaum (born March 16, 1944), sometimes referred to by the handle ast,[6] is an American-Dutch Physicist and Professor emeritus of Computer Science at the Vrije Universiteit Amsterdam in Netherlands.[7][8] He is best known as the author of MINIX, a free Unix-like operating system for teaching purposes, and for his computer science textbooks, regarded as standard texts in the field.",
    "Title": "Computer Networks",
    "Description": "For courses in computer networking or introductions to networking at both the undergraduate and graduate level in computer science, engineering, CIS, MIS, and business departments. In this revision, the author takes a structured approach to explaining how networks function.",
    "Ratings": [
      5,
      5,
      3,
      2,
      1,
      5
    ],
    "Comments": null
  },
  {
    "Id": "Effective Java",
    "Maker": "vogueandcode",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/EffectiveJava.jpg",
    "Url": "https://kea.nu/files/textbooks/new/Effective%20Java%20%282017%2C%20Addison-Wesley%29.pdf",
    "Author": "Joshua Bloch",
    "Publisher": "Independently published",
    "Publication": "November, 2021",
    "ISBN": "979-8773656951",
    "Author_Description": "Joshua J. Bloch is an American software engineer and a technology author, formerly employed at Sun Microsystems and Google. He led the design and implementation of numerous Java platform features, including the Java Collections Framework, the java.math package, and the assert mechanism.",
    "Title": "Effective Java",
    "Description": "Bloch updates the work to take advantage of these new language and library features, and provides specific best practices for their use. Java\u0027s increased support for multiple paradigms increases the need for best-practices advice, and this book delivers.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Patterns of Enterprise Application Architecture",
    "Maker": "vogueandcode",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/PatternsofEnterpriseApplicationArchitecture.jpg",
    "Url": "https://pdf.zlibcdn.com/dtoken/732da4df03cbbc8f6a608633a2cb94a0/Computer_Systems_A_Programmers_Perspective_by_Ra_2611328_(z-lib.org).pdf",
    "Author": "Martin Fowler, David Rice, Matthew Foemmel",
    "Publisher": " Addison-Wesley Professional; 1st edition",
    "Publication": "November, 2002",
    "ISBN": "978-0321127426",
    "Author_Description": "martin : Martin Fowler is an American-resident British software developer, author and international public speaker on software development, specialising in object-oriented analysis and design including extreme programming. David Rice:",
    "Title": "Patterns of Enterprise Application Architecture",
    "Description": "Patterns of Enterprise Application Architecture is written in direct response to the stiff challenges that face enterprise application developers. The author, noted object-oriented designer Martin Fowler, noticed that despite changes in technology--from Smalltalk to CORBA to Java to .NET--the same basic design ideas can be adapted and applied to solve common problems. With the help of an expert group of contributors, Martin distills over forty recurring solutions into patterns. The result is an indispensable handbook of solutions that are applicable to any enterprise application platform.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Deep Learning",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/DeepLearning.jpg",
    "Url": "https://pdf.zlibcdn.com/dtoken/2f9e3b8b376ebff1f2e982cdfefb6bca/Deep_Learning_by_Ian_Goodfellow,_Yoshua_Bengio,_Aa_3679112_(z-lib.org).pdf",
    "Author": "Ian Goodfellow, Yoshua Bengio, Aaron Courville",
    "Publisher": " The MIT Press; Illustrated edition",
    "Publication": "November, 2016",
    "ISBN": "978-0262035613",
    "Author_Description": "Ian J. Goodfellow: he is a researcher working in machine learning, currently employed at Apple Inc. as its director of machine learning in the Special Projects Group. Yoshua Bengio: Yoshua Bengio FRS OC FRSC is a Canadian computer scientist, most noted for his work on artificial neural networks and deep learning. Aaron Courville: he is a Canada CIFAR AI Chair at Mila, a CIFAR fellow of the Learning in Machines and Brains program, and an associate professor in the Department of Computer Science and Operations Research (DIRO) at Universit? de Montr?al.",
    "Title": "Deep Learning",
    "Description": "The text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and videogames. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models.",
    "Ratings": [
      5
    ],
    "Comments": null
  },
  {
    "Id": "Superintelligence: Paths, Dangers, Strategies",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/SuperintelligencePathsDangersStrategies.jpg",
    "Url": "https://media.archiware.ir/LifeBits/AI-Books/Superintelligence.pdf",
    "Author": "Nick Bostrom",
    "Publisher": "Audible Studios",
    "Publication": "September, 2014",
    "ISBN": "9780199678112",
    "Author_Description": "Nick Bostrom is a Swedish-born philosopher at the University of Oxford known for his work on existential risk, the anthropic principle, human enhancement ethics, superintelligence risks, and the reversal test.",
    "Title": "Superintelligence: Paths, Dangers, Strategies",
    "Description": "The human brain has some capabilities that the brains of other animals lack. It is to these distinctive capabilities that our species owes its dominant position. If machine brains surpassed human brains in general intelligence, then this new superintelligence could become extremely powerful--possibly beyond our control. As the fate of the gorillas now depends more on humans than on the species itself, so would the fate of humankind depend on the actions of the machine superintelligence.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Computer Graphics: From Pixels to Programmable Graphics Hardware",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/FromPixelstoProgrammableGraphicsHardware.jpg",
    "Url": "https://pdf.zlibcdn.com/dtoken/f87a935fbb41c3b3ec4758516e6a0813/Computer_Graphics__From_Pixels_to_Programmable_Gr_2542915_(z-lib.org).pdf",
    "Author": "Alexey Boreskov",
    "Publisher": "Chapman and Hall/CRC",
    "Publication": "October, 2013",
    "ISBN": "Not enabled",
    "Author_Description": null,
    "Title": "Computer Graphics: From Pixels to Programmable Graphics Hardware",
    "Description": "Modern graphics ?shader architecture? provides unprecedented access to graphical functions and processing power. With this full-color book, programmers can harness its capabilities.",
    "Ratings": [
      5
    ],
    "Comments": null
  },
  {
    "Id": "Cloud Computing for dummies",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/CloudComputingforDummies.jpg",
    "Url": "https://fit.mta.edu.vn/files/DanhSach/_R_Book_HP_cloudcomputingfordummies.pdf",
    "Author": "Judith Hurwitz",
    "Publisher": "For Dummies; 1st edition",
    "Publication": "November, 2009",
    "ISBN": "978-0470484708",
    "Author_Description": "Judith S. Hurwitz is President and CEO of Hurwitz & Associates, LLC, a research and consulting firm focused on emerging technology including big data, cloud computing, service management, software development, computing management, and security.",
    "Title": "Cloud Computing for dummies",
    "Description": "Most of the information available on cloud computing is either highly technical, with details that are irrelevant to non-technologists, or pure marketing hype, in which the cloud is simply a selling point. This book, however, explains the cloud from the user\u0027s viewpoint?the business user\u0027s in particular. Nayan Ruparelia explains what the cloud is, when to use it (and when not to), how to select a cloud service, how to integrate it with other technologies, and what the best practices are for using cloud computing.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "SQL QuickStart Guide",
    "Maker": "selinazawacki",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/SQLQuickStartGuide.jpg",
    "Url": "https://pdf.zlibcdn.com/dtoken/ed7a87580f2ae2f317ceea25392ef994/SQL_QuickStart_Guide_The_Simplified_Beginners_Gu_5477257_(z-lib.org).pdf",
    "Author": "Walter Shields",
    "Publisher": "ClydeBank Media LLC",
    "Publication": "November, 2015",
    "ISBN": "Not enabled",
    "Author_Description": "Nick Bostrom is a Swedish-born philosopher at the University of Oxford known for his work on existential risk, the anthropic principle, human enhancement ethics, superintelligence risks, and the reversal test.",
    "Title": "SQL QuickStart Guide",
    "Description": "The human brain has some capabilities that the brains of other animals lack. It is to these distinctive capabilities that our species owes its dominant position. If machine brains surpassed human brains in general intelligence, then this new superintelligence could become extremely powerful--possibly beyond our control. As the fate of the gorillas now depends more on humans than on the species itself, so would the fate of humankind depend on the actions of the machine superintelligence.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": "Cracking the Coding Interview",
    "Maker": "jenlooper",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images2/CrackingtheCodingInterview.png",
    "Url": "https://pdf.zlibcdn.com/dtoken/2398f310290f4d0da5e1f14bc0061eda/Cracking_the_Coding_Interview_189_Programming_Que_2724521_(z-lib.org).pdf",
    "Author": "Gayle Laakmann McDowell",
    "Publisher": "CareerCup",
    "Publication": "January, 2015",
    "ISBN": "978-0984782864",
    "Author_Description": "Gayle Laakmann McDowell (born 1982)[1] is a founder, software engineer, and author. She is known for a career development book Cracking the Coding Interview.",
    "Title": "Cracking the Coding Interview",
    "Description": "Cracking the Coding Interview gives you the interview preparation you need to get the top software developer jobs. This is a deeply technical book and focuses on the software engineering skills to ace your interview. The book is over 500 pages and includes 150 programming interview questions and answers, as well as other advice.",
    "Ratings": null,
    "Comments": null
  },
  {
    "Id": " Modern Multithreading",
    "Maker": "selinazawacki2",
    "img": "https://temptejasstrg11p6.blob.core.windows.net/images/multithreading.jpg",
    "Url": "https://tfetimes.com/wp-content/uploads/2015/09/modern-multithreading-c-java.pdf",
    "Author": "Richard H. Carver, Kuo-Chung Tai",
    "Publisher": "Wiley-Interscience; 1st edition",
    "Publication": "October, 2005",
    "ISBN": "978-0471725046",
    "Author_Description": "Maya Posch is a senior C++ developer with more than 15 years of experience. Discovering the joys of programming early on, and later the joys of electronics, she has always expressed a profound interest in technology.",
    "Title": "Modern Multithreading",
    "Description": "This textbook examines languages and libraries for multithreaded programming. Readers learn how to create threads in Java and C\u002B\u002B, and develop essential concurrent programming and problem-solving skills. Moreover, the textbook sets itself apart from other comparable works by helping readers to become proficient in key testing and debugging techniques. Among the topics covered, readers are introduced to the relevant aspects of Java, the POSIX Pthreads library, and the Windows Win32 Applications Programming Interface.",
    "Ratings": [
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5
    ],
    "Comments": null
  }
]